/**
 * @file    clock.c
 * @brief   Реалізація ініціалізації системи тактування.
 */

#include "clock.h"

/**
 * @brief   Ініціалізація системи тактування (встановлення частоти 16 МГц).
 */
void CLOCK_Init(void) 
{
    /* * Регістр CLK_CKDIVR (Clock divider register)
     * Згідно з RM0016 (розділ Clock Controller):
     * Біти [4:3] HSIDIV відповідають за дільник HSI.
     * Значення після скидання (Reset value): 0b11 (дільник на 8, частота 2 МГц).
     * Щоб отримати 16 МГц, потрібно записати в біти [4:3] значення 0b00 (дільник на 1).
     * Примусово скидаємо біти 3 та 4 в нуль за допомогою маски.
     */
    CLK_CKDIVR &= ~(CLK_CKDIVR_HSIDIV_MASK);
}

/**
 * @brief Програмна затримка в мікросекундах (налаштована під ядро 16 МГц)
 * @param us Кількість мікросекунд для очікування
 */
void delay_us(uint32_t us) 
{
    /* * На частоті 16 МГц 1 такт = 62.5 наносекунди.
     * Один прохід цього циклу (перевірка + віднімання + nop + перехід) 
     * займає приблизно 4 такти (250 нс). 
     * Тому, щоб отримати 1 мкс, треба помножити us на 4.
     */
    us = us * 4; 
    while (us--)
    {
        _asm("nop"); /* Порожня інструкція, щоб процесор спалив 1 такт */
    }
}