/**
 * @file    settings.h
 * @brief   Бізнес-логіка збереження налаштувань (P0-P7) в EEPROM.
 */

#ifndef SETTINGS_H
#define SETTINGS_H

#include "board_config.h"

/* ========================================================================== */
/* ТИПИ ДАНИХ (Словник параметрів)                                            */
/* ========================================================================== */

/* Усі налаштування, які має наш термостат */
typedef enum
{
    PARAM_TARGET_TEMP = 0, /* Цільова температура */
    PARAM_P0_MODE,         /* Режим (0 - Heat, 1 - Cool) */
    PARAM_P1_HYST,         /* Гістерезис (*10) */
    PARAM_P2_MAX_LIMIT,    /* Верхня межа (*10) */
    PARAM_P3_MIN_LIMIT,    /* Нижня межа (*10) */
    PARAM_P4_CALIB,        /* Калібрування (*10) */
    PARAM_P5_DELAY,        /* Затримка (хвилини) */
    PARAM_P6_ALARM,        /* Аварія (*10) */
    PARAM_P7_RESET,        /* Скидання до заводьсих налаштувань*/
    PARAM_COUNT            /* Кількість параметрів (8) */
} param_id_t;

/* ========================================================================== */
/* ПУБЛІЧНІ ФУНКЦІЇ (API)                                                     */
/* ========================================================================== */

/**
 * @brief Ініціалізація. Читає EEPROM, при першому старті записує дефолти.
 */
void Settings_Init(void);

/**
 * @brief Миттєво повертає значення параметра з оперативної пам'яті (RAM).
 */
int16_t Settings_Get(param_id_t param);

/**
 * @brief Змінює параметр, оновлює RAM і зберігає його в EEPROM.
 */
void Settings_Set(param_id_t param, int16_t value);

/**
 * @brief Скидає всі налаштування до заводських (дія для меню P7).
 */
void Settings_ResetToDefault(void);

#endif /* SETTINGS_H */